1c_um/src/InformationRegisters/ум_ПакетыДанных/ум_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанных</name>
  <resources>
    <name>ВременнаяМеткаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПакетПрипаркован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/InformationRegisters/ум_ПакетыДанныхДанные/ум_ПакетыДанныхДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанныхДанные</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/Enums/ум_СостоянияПакетаДанных/ум_СостоянияПакетаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_СостоянияПакетаДанных</name>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ум_СпособыОбработкиПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_СпособыОбработкиПакетов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МногопоточноеИзменениеПакетовДанных</name>
      <description>Многопоточное изменение пакетов данных</description>
    </items>
    <items>
      <name>ОчисткаЛоговФЗ</name>
      <description>Очистка логов ФЗ</description>
    </items>
    <items>
      <name>ПакетыДанныхОбслуживание</name>
      <description>Регламентное обслуживание пакетов данных</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниУправляющегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаУправляющееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниРабочегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаРабочееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторнаяОбработкаПакетовСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутПовторнойОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПакетПриУспешнойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутУдаленияПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщийСписокОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизвольныйКодОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаПроизвольногоКодаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиОбработкиПакетов</name>
    <attributes>
      <name>ОписаниеОшбики</name>
      <type>
        <types>CatalogRef.ум_ОписанияОшибокОбработкиПакетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1c_um/src/CommonModules/ум_ПакетыДанныхОбщегоНазначения/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПустойУникальныйИдентификатор() Экспорт
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
КонецФункции

Процедура УстановитьБлокировкуРегистраПакетов(Знач ИмяРегистраПакета, Знач МассивИдентификаторовПакетов) Экспорт
	
	ТаблицаИДПакетов = Новый ТаблицаЗначений;
	ТаблицаИДПакетов.Колонки.Добавить("ИдентификаторПакета", Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	Если ТипЗнч(МассивИдентификаторовПакетов) = Тип("УникальныйИдентификатор") Тогда
		СтрТаб = ТаблицаИДПакетов.Добавить();
		СтрТаб.ИдентификаторПакета = МассивИдентификаторовПакетов;
	Иначе
		Для каждого ИДПакета Из МассивИдентификаторовПакетов Цикл
			СтрТаб = ТаблицаИДПакетов.Добавить();
			СтрТаб.ИдентификаторПакета = ИДПакета;
		КонецЦикла
	КонецЕсли;
	
	БлокировкаРегистра = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаРегистра.Добавить("РегистрСведений." + ИмяРегистраПакета);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаИДПакетов;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ИдентификаторПакета", "ИдентификаторПакета");
	БлокировкаРегистра.Заблокировать();
	
КонецПроцедуры

// Проверка наличия необработанных пакетов по способу обработки
// 
// Параметры:
//  СпособОбработки    - Справочник.ум_СпособыОбработкиПакетов
//
// Возвращаемое значение:
//   Булево - Истина есть необработанные пакеты, Ложь - нет
Функция ЕстьНеобработанныеПакетыПоСпособуОбработки(СпособОбработки) Экспорт
	
	Если ТипЗнч(СпособОбработки) = Тип("Строка") Тогда
		СпособОбработкиСсылка = ум_ПакетыДанныхПовтИсп.ПолучитьСпособОбработкиПоИмени(СпособОбработки);
	Иначе
		СпособОбработкиСсылка = СпособОбработки;
	КонецЕсли;	
	
	Если НЕ ТипЗнч(СпособОбработкиСсылка) = Тип("СправочникСсылка.ум_СпособыОбработкиПакетов") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_ПакетыДанных.ИдентификаторПакета КАК ИдентификаторПакета
	|ИЗ
	|	РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|ГДЕ
	|	ум_ПакетыДанных.КлючАналитикиПакетаДанных = &КлючАналитикиПакетаДанныхВОбработке
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_ПакетыДанных.ИдентификаторПакета
	|ИЗ
	|	РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|ГДЕ
	|	ум_ПакетыДанных.КлючАналитикиПакетаДанных = &КлючАналитикиПакетаДанныхКОбработке";
	
	Запрос = Новый Запрос(ТекстЗапроса);   
	КлючАналитикиПакетаДанныхВОбработке = ум_ПакетыДанныхПовтИсп.ПолучитьКлючАналитикиПакетаДанных(СпособОбработкиСсылка, Перечисления.ум_СостоянияПакетаДанных.ВОбработке);
	КлючАналитикиПакетаДанныхКОбработке = ум_ПакетыДанныхПовтИсп.ПолучитьКлючАналитикиПакетаДанных(СпособОбработкиСсылка, Перечисления.ум_СостоянияПакетаДанных.КОбработке);
	
	Запрос.УстановитьПараметр("КлючАналитикиПакетаДанныхВОбработке", КлючАналитикиПакетаДанныхВОбработке);
	Запрос.УстановитьПараметр("КлючАналитикиПакетаДанныхКОбработке", КлючАналитикиПакетаДанныхКОбработке);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьПараметрыСпособаОбработки(СпособОбработкиПакета) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_СпособыОбработкиПакетов.Ссылка КАК СпособОбработки,
	|	ум_СпособыОбработкиПакетов.Активность КАК Активность,
	|	ум_СпособыОбработкиПакетов.ИмяФункции КАК ИмяФункции,
	|	ум_СпособыОбработкиПакетов.Наименование КАК ИмяСпособаОбработки,
	|	ум_СпособыОбработкиПакетов.ВремяЖизниУправляющегоФЗ КАК ВремяЖизниУправляющегоФЗ,
	|	ум_СпособыОбработкиПакетов.КоличествоПакетовНаУправляющееФЗ КАК КоличествоПакетовНаУправляющееФЗ,
	|	ум_СпособыОбработкиПакетов.КоличествоРабочихФЗ КАК КоличествоРабочихФЗ,
	|	ум_СпособыОбработкиПакетов.КоличествоПакетовНаРабочееФЗ КАК КоличествоПакетовНаРабочееФЗ,
	|	ум_СпособыОбработкиПакетов.КоличествоПопытокОбработкиПакета КАК КоличествоПопытокОбработкиПакета,
	|	ум_СпособыОбработкиПакетов.ТаймаутПовторнойОбработкиПакета КАК ТаймаутПовторнойОбработкиПакета,
	|	ум_СпособыОбработкиПакетов.ПовторнаяОбработкаПакетовСОшибками КАК ПовторнаяОбработкаПакетовСОшибками,
	|	ум_СпособыОбработкиПакетов.УдалятьПакетПриУспешнойОбработке КАК УдалятьПакетПриУспешнойОбработке,
	|	ум_СпособыОбработкиПакетов.ТаймаутУдаленияПакета КАК ТаймаутУдаленияПакета,
	|	ум_СпособыОбработкиПакетов.ИспользоватьОбщийСписокОшибок КАК ИспользоватьОбщийСписокОшибок,
	|	ум_СпособыОбработкиПакетов.ИспользоватьПроизвольныйКодОбработки КАК ИспользоватьПроизвольныйКодОбработки,
	|	ум_СпособыОбработкиПакетов.ПроизвольныйКодОбработки КАК ПроизвольныйКодОбработки,
	|	ум_СпособыОбработкиПакетов.ХешСуммаПроизвольногоКодаОбработки КАК ХешСуммаПроизвольногоКодаОбработки
	|ПОМЕСТИТЬ ДанныеСпособаОбработки
	|ИЗ
	|	Справочник.ум_СпособыОбработкиПакетов КАК ум_СпособыОбработкиПакетов
	|ГДЕ
	|	ум_СпособыОбработкиПакетов.Ссылка = &СпособОбработкиПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСпособаОбработки.СпособОбработки КАК СпособОбработки,
	|	ДанныеСпособаОбработки.Активность КАК Активность,
	|	ДанныеСпособаОбработки.ИмяФункции КАК ИмяФункции,
	|	ДанныеСпособаОбработки.ИмяСпособаОбработки КАК ИмяСпособаОбработки,
	|	ДанныеСпособаОбработки.ВремяЖизниУправляющегоФЗ КАК ВремяЖизниУправляющегоФЗ,
	|	ДанныеСпособаОбработки.КоличествоПакетовНаУправляющееФЗ КАК КоличествоПакетовНаУправляющееФЗ,
	|	ДанныеСпособаОбработки.КоличествоРабочихФЗ КАК КоличествоРабочихФЗ,
	|	ДанныеСпособаОбработки.КоличествоПакетовНаРабочееФЗ КАК КоличествоПакетовНаРабочееФЗ,
	|	ДанныеСпособаОбработки.КоличествоПопытокОбработкиПакета КАК КоличествоПопытокОбработкиПакета,
	|	ДанныеСпособаОбработки.ТаймаутПовторнойОбработкиПакета КАК ТаймаутПовторнойОбработкиПакета,
	|	ДанныеСпособаОбработки.ПовторнаяОбработкаПакетовСОшибками КАК ПовторнаяОбработкаПакетовСОшибками,
	|	ДанныеСпособаОбработки.УдалятьПакетПриУспешнойОбработке КАК УдалятьПакетПриУспешнойОбработке,
	|	ДанныеСпособаОбработки.ТаймаутУдаленияПакета КАК ТаймаутУдаленияПакета,
	|	ДанныеСпособаОбработки.ИспользоватьОбщийСписокОшибок КАК ИспользоватьОбщийСписокОшибок,
	|	ДанныеСпособаОбработки.ИспользоватьПроизвольныйКодОбработки КАК ИспользоватьПроизвольныйКодОбработки,
	|	ДанныеСпособаОбработки.ПроизвольныйКодОбработки КАК ПроизвольныйКодОбработки,
	|	ДанныеСпособаОбработки.ХешСуммаПроизвольногоКодаОбработки КАК ХешСуммаПроизвольногоКодаОбработки
	|ИЗ
	|	ДанныеСпособаОбработки КАК ДанныеСпособаОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ум_ОписанияОшибокОбработкиПакетов.Наименование КАК ОписаниеОшбики
	|ПОМЕСТИТЬ ВТ_ОписанияОшбики
	|ИЗ
	|	ДанныеСпособаОбработки КАК ДанныеСпособаОбработки,
	|	Справочник.ум_ОписанияОшибокОбработкиПакетов КАК ум_ОписанияОшибокОбработкиПакетов
	|ГДЕ
	|	ДанныеСпособаОбработки.ИспользоватьОбщийСписокОшибок
	|	И ум_ОписанияОшибокОбработкиПакетов.ВключитьВОбщийСписокОшибок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ум_СпособыОбработкиПакетовОшибкиОбработкиПакетов.ОписаниеОшбики.Наименование
	|ИЗ
	|	ДанныеСпособаОбработки КАК ДанныеСпособаОбработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ум_СпособыОбработкиПакетов.ОшибкиОбработкиПакетов КАК ум_СпособыОбработкиПакетовОшибкиОбработкиПакетов
	|		ПО ДанныеСпособаОбработки.СпособОбработки = ум_СпособыОбработкиПакетовОшибкиОбработкиПакетов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОписанияОшбики.ОписаниеОшбики КАК ОписаниеОшбики
	|ИЗ
	|	ВТ_ОписанияОшбики КАК ВТ_ОписанияОшбики
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОписанияОшбики.ОписаниеОшбики";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СпособОбработкиПакета" , СпособОбработкиПакета);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	РезультатДанныеСпособаОбработки = МассивРезультатов[1];
	РезультатОписаниеОшибок = МассивРезультатов[3];
	
	ВыборкаПараметровСпособаОбработки = РезультатДанныеСпособаОбработки.Выбрать();
	ВыборкаПараметровСпособаОбработки.Следующий(); 
	
	СписокПропускаемыхОшибок = Новый Массив;
	// запомним порядок ведения журнала событий способа обработки
	ОписаниеОшибок = РезультатОписаниеОшибок.Выбрать();
	Пока ОписаниеОшибок.Следующий() Цикл
		СписокПропускаемыхОшибок.Добавить(ОписаниеОшибок.ОписаниеОшбики);
	КонецЦикла;
	
	// Запомним параметры способа обработки
	ПараметрыСпособаОбработки = Новый Структура;
	
	ПараметрыСпособаОбработки.Вставить("СпособОбработки"						, ВыборкаПараметровСпособаОбработки.СпособОбработки);
	ПараметрыСпособаОбработки.Вставить("Активность"								, ВыборкаПараметровСпособаОбработки.Активность);
	ПараметрыСпособаОбработки.Вставить("ИмяФункции"								, ВыборкаПараметровСпособаОбработки.ИмяФункции);
	ПараметрыСпособаОбработки.Вставить("ИмяСпособаОбработки"					, ВыборкаПараметровСпособаОбработки.ИмяСпособаОбработки);
	ПараметрыСпособаОбработки.Вставить("ВремяЖизниУправляющегоФЗ"				, ВыборкаПараметровСпособаОбработки.ВремяЖизниУправляющегоФЗ);
	ПараметрыСпособаОбработки.Вставить("КоличествоПакетовНаУправляющееФЗ"		, ВыборкаПараметровСпособаОбработки.КоличествоПакетовНаУправляющееФЗ);
	ПараметрыСпособаОбработки.Вставить("КоличествоРабочихФЗ"					, ВыборкаПараметровСпособаОбработки.КоличествоРабочихФЗ);
	ПараметрыСпособаОбработки.Вставить("КоличествоПакетовНаРабочееФЗ"			, ВыборкаПараметровСпособаОбработки.КоличествоПакетовНаРабочееФЗ);
	 
	// Удаление по таймауту
	ПараметрыСпособаОбработки.Вставить("УдалятьПакетПриУспешнойОбработке"		, ВыборкаПараметровСпособаОбработки.УдалятьПакетПриУспешнойОбработке);
	ПараметрыСпособаОбработки.Вставить("ТаймаутУдаленияПакета"					, ВыборкаПараметровСпособаОбработки.ТаймаутУдаленияПакета);
	
	// исполняемый код
	ПараметрыСпособаОбработки.Вставить("ИспользоватьПроизвольныйКодОбработки"	, ВыборкаПараметровСпособаОбработки.ИспользоватьПроизвольныйКодОбработки);
	ПараметрыСпособаОбработки.Вставить("ПроизвольныйКодОбработки"				, ВыборкаПараметровСпособаОбработки.ПроизвольныйКодОбработки);
	ПараметрыСпособаОбработки.Вставить("ХешСуммаПроизвольногоКодаОбработки"		, ВыборкаПараметровСпособаОбработки.ХешСуммаПроизвольногоКодаОбработки);
	
	// Повторная обработка
	ПараметрыСпособаОбработки.Вставить("КоличествоПопытокОбработкиПакета"		, ВыборкаПараметровСпособаОбработки.КоличествоПопытокОбработкиПакета);
	ПараметрыСпособаОбработки.Вставить("ПовторнаяОбработкаПакетовСОшибками"		, ВыборкаПараметровСпособаОбработки.ПовторнаяОбработкаПакетовСОшибками);
	ПараметрыСпособаОбработки.Вставить("ТаймаутПовторнойОбработкиПакета"		, ВыборкаПараметровСпособаОбработки.ТаймаутПовторнойОбработкиПакета);
	ПараметрыСпособаОбработки.Вставить("СписокПропускаемыхОшибок", СписокПропускаемыхОшибок);
	
	Возврат ПараметрыСпособаОбработки;
	
КонецФункции



// Преобразует числовую метку времени (в миллисекундах от 01.01.0001 UTC) в локальную дату.
//
// Параметры:
//  ВременнаяМетка - Число - Метка времени в миллисекундах.
//
// Возвращаемое значение:
//  Дата - Локальная дата.
Функция МеткаВремениВДатуUTC(Знач ВременнаяМетка) Экспорт
		
	Если ТипЗнч(ВременнаяМетка) <> Тип("Число") Или ВременнаяМетка <= 0 Тогда
		Возврат '00010101';
	КонецЕсли;
	
	Возврат '00010101' + Цел(ВременнаяМетка / 1000);
	
КонецФункции

// Преобразует локальную дату в числовую метку времени (в миллисекундах от 01.01.0001 UTC).
//
// Параметры:
//  ЛокальнаяДата - Дата - Дата в локальном времени сеанса.
//
// Возвращаемое значение:
//  Число - Метка времени в миллисекундах.
Функция ДатаВМеткуВремениUTC(Знач ЛокальнаяДата) Экспорт
	
	Возврат ?(ЗначениеЗаполнено(ЛокальнаяДата), (УниверсальноеВремя(ЛокальнаяДата) - '00010101000000') * 1000, 0);
	
КонецФункции  

#Область ИмяДляРазработчика

// Проверяет имя для разработчика на уникальность, не должно повторятся в БД
// 
// Параметры:
//	ИмяДляРазработчика - <Строка> - имя для разработчика, которое проверяется на уникальность
//  СсылкаНаОбъект     - <Ссылка> - реквизит ссылочного типа 
//
// Возвращаемое значение:
//	<Булево> - Истина имя для разработчика уникально (нет других объектов с таким значением), Ложь - нет
Функция ИмяДляРазработчикаУникально(ИмяДляРазработчика, СсылкаНаОбъект, ИмяОбъекта = "") Экспорт
	
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ПолноеИмяОбъекта = ИмяОбъекта;
	Иначе
		ПолноеИмяОбъекта = СсылкаНаОбъект.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяДляРазработчика", ИмяДляРазработчика);
	Запрос.УстановитьПараметр("СсылкаНаОбъект",     СсылкаНаОбъект);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.ИмяДляРазработчика КАК ИмяДляРазработчика
	|ИЗ
	|	&ИмяТаблицы КАК Таблица
	|ГДЕ
	|	Таблица.ИмяДляРазработчика = &ИмяДляРазработчика
	|	И Таблица.Ссылка <> &СсылкаНаОбъект";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ПолноеИмяОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции // ИмяДляРазработчикаУникально()

// Генерирует имя для разработчика: 
// убирает из "СтрокаПредставления" существующие пробелы, спецсимвролы и 
// первые символы после пробела или нижнего подчеркивания переводит в верхний регистр.
// 
// Параметры:
//   СтрокаПредставления - <Строка> - наименование объекта
//   СсылкаНаОбъект - <Ссылочный тип> - ссылка на объект у которого есть реквизит "ИмяДляРазработчика".
//
// Возвращаемое значение:
//	<Строка> - сгенерированное имя разработчика
Функция ИмяДляРазработчикаИзСтроки(СтрокаПредставления) Экспорт
	
	СпецСимволы = СпецСимволы();
	
	Результат = "";
	БылСпецСимвол = Ложь;
	Для НомСимвола = 1 По СтрДлина(СтрокаПредставления) Цикл
		
		Символ = Сред(СтрокаПредставления, НомСимвола, 1);
		Если СтрНайти(СпецСимволы, Символ) Тогда
			БылСпецСимвол = Истина;
			Если Символ = "_" Тогда
				Результат = Результат + Символ;
			КонецЕсли;
		ИначеЕсли БылСпецСимвол	ИЛИ НомСимвола = 1 Тогда
			БылСпецСимвол = Ложь;
			Результат = Результат + ВРег(Символ);
		Иначе
			Результат = Результат + Символ;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ИмяДляРазработчикаИзСтроки()

// Генерирует уникальное имя для разработчика, не сущетвующее в БД,  
// убирает из "ПредставлениеОбъекта" существующие пробелы, спецсимвролы и 
// первые символы после пробела или нижнего подчеркивания переводит в верхний регистр.
// 
// Параметры:
//   ПредставлениеОбъекта - <Строка> - наименование объекта
//   СсылкаНаОбъект - <Ссылочный тип> - ссылка на объект у которого есть реквизит "ИмяДляРазработчика".
//
// Возвращаемое значение:
//	<Строка> - сгенерированное уникальное имя разработчика
Функция УникальноеИмяДляРазработчика(ПредставлениеОбъекта, СсылкаНаОбъект) Экспорт
	Перем МаксимальнаяДлина;
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	// Определяем длину реквизита ИмяДляРазработчика
	Реквизит = МетаданныеОбъекта.Реквизиты.Найти("ИмяДляРазработчика");
	Если Не Реквизит = Неопределено Тогда
		ТипРеквизита = Реквизит.Тип;
		Если ТипРеквизита.СодержитТип(Тип("Строка")) Тогда
			МаксимальнаяДлина = ТипРеквизита.КвалификаторыСтроки.Длина;
		КонецЕсли;
	КонецЕсли;
	
	// Не смогли определить длину реквизита 
	Если Не ЗначениеЗаполнено(МаксимальнаяДлина) Тогда
		ВызватьИсключение "Не определена длина реквизита ""ИмяДляРазработчика""";
	КонецЕсли;
	
	ИмяДляРазработчика = ИмяДляРазработчикаИзСтроки(ПредставлениеОбъекта);
	
	Если ПустаяСтрока(ИмяДляРазработчика) Тогда
		// Представление состоит и спецсимволов или цифр.
		Префикс = НСтр("ru = 'Идентификатор'");
		ИмяДляРазработчика = ИмяДляРазработчикаИзСтроки(Префикс + ПредставлениеОбъекта);
	КонецЕсли;
	
	Если СтрДлина(ИмяДляРазработчика) > МаксимальнаяДлина Тогда
		ВызватьИсключение СтрШаблон("Длина имени разработчика превышает максимально возможную %1", МаксимальнаяДлина);
	КонецЕсли;
	
	Уникально = ИмяДляРазработчикаУникально(ИмяДляРазработчика, СсылкаНаОбъект, ПолноеИмяОбъекта);
	Если Не Уникально Тогда
		
		ИспользованныеИдентификаторы = ИспользованныеИменаДляРазработчика(ИмяДляРазработчика, СсылкаНаОбъект, ПолноеИмяОбъекта);
		
		ДобавляемыйНомер = 1;
		ИмяДляРазработчикаБезНомера = ИмяДляРазработчика;
		Пока НЕ ИспользованныеИдентификаторы.Получить(ВРЕГ(ИмяДляРазработчика)) = Неопределено Цикл
			ИмяДляРазработчика = ИмяДляРазработчикаБезНомера + Формат(ДобавляемыйНомер, "ЧГ=");
			Если СтрДлина(ИмяДляРазработчика) > МаксимальнаяДлина Тогда
				СтрШаблон("Длина имени разработчика превышает максимально возможную %1", МаксимальнаяДлина);
			КонецЕсли;
			ДобавляемыйНомер = ДобавляемыйНомер + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИмяДляРазработчика;
	
КонецФункции // УникальноеИмяДляРазработчика()

// Проверяет уникальность идентификатора, а также соответствие идентификатора правилам написания
// 
// Параметры:
//   ИмяДляРазработчика - Строка - идентификатор для формул.
//   Ссылка - <Ссылочный тип> - ссылка на объект у которого есть реквизит "ИмяДляРазработчика".
//   Отказ  - <Булево> - флаг отказа при наличии ошибки.
//
Процедура ПроверитьУникальностьИмяДляРазработчика(ИмяДляРазработчика, Ссылка, Отказ) Экспорт
	
	Если ЗначениеЗаполнено(ИмяДляРазработчика) Тогда
		
		ИдентификаторПоПравилам = Истина;
		ПроверочныйИдентификатор = ИмяДляРазработчикаИзСтроки(ИмяДляРазработчика);
		Если НЕ ВРег(ПроверочныйИдентификатор) = ВРег(ИмяДляРазработчика) Тогда
			ИдентификаторПоПравилам = Ложь;
			
			ТекстОшибки = НСтр("ru = 'Имя для разработчика не соответствует правилам именования переменных,
									  |оно не должено содержать пробелов и специальных символов.'");
			//ТекстОшибки = СтрШаблон(ТекстШаблона, ИмяДляРазработчика);
			ум_БСП_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "ИмяДляРазработчика", "Объект", Отказ);
		КонецЕсли;
		
		Если ИдентификаторПоПравилам Тогда
			Если НЕ ИмяДляРазработчикаУникально(ИмяДляРазработчика, Ссылка) Тогда
				ТекстШаблона = НСтр("ru = 'Имя для разработчика не уникально: ""%1""'");
				ТекстОшибки  = СтрШаблон(ТекстШаблона, ИмяДляРазработчика);
				ум_БСП_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "ИмяДляРазработчика", "Объект" ,Отказ);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ТекстШаблона = НСтр("ru = 'Имя для разработчика не заполнено'");
		ТекстОшибки  = СтрШаблон(ТекстШаблона, ИмяДляРазработчика);
		ум_БСП_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "ИмяДляРазработчика",, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьУникальностьИмяДляРазработчика()

#КонецОбласти // ИмяДляРазработчика

// Рассчитывает Хеш сумму MD5 для произвольного кода обработки
// 
// Параметры:
//   ПроизвольныйКодОбработки - <Строка> - Произвольный код обработки.
//
// Возвращаемое значение:
//	<Строка> - расчитанная хеш сумма MD5
Функция ХешФункцияПроизвольногоКода(ПроизвольныйКодОбработки) Экспорт
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5); 
	Хеш.Добавить(ПроизвольныйКодОбработки);
	Результат = СтрЗаменить(Строка(Хеш.ХешСумма), " ", "");
	
	Возврат Результат;
	
КонецФункции // ХешФункцияПроизвольногоКода()


// Получает данные пакета по идентификатору
// 
// Параметры:
//   ПроизвольныйКодОбработки - <УникальныйИдентификатор> - Идентификатор пакета или результата обработки пакета.
//
// Возвращаемое значение:
//   <Хранилище значений> - Данные пакета
Функция ПолучитьДанныеПакета(ИдентификаторПакета) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_ПакетыДанныхДанные.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.ум_ПакетыДанныхДанные КАК ум_ПакетыДанныхДанные
	|ГДЕ
	|	ум_ПакетыДанныхДанные.ИдентификаторПакета = &ИдентификаторПакета";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("ИдентификаторПакета", ИдентификаторПакета);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		ВызватьИсключение "Не найдены данные пакета данных с идентификатором " + ИдентификаторПакета;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Данные.Получить();
	
КонецФункции // ПолучитьДанныеПакета()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ИспользованныеИменаДляРазработчика(ИмяДляРазработчика, СсылкаНаОбъект, ПолноеИмяОбъекта)
	
	//ПолноеИмяОбъекта = СсылкаНаОбъект.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИмяДляРазработчика", ум_БСП_ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(ИмяДляРазработчика) + "%");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.ИмяДляРазработчика КАК ИмяДляРазработчика
	|ИЗ
	|	&ИмяТаблицы КАК Таблица
	|ГДЕ
	|	Таблица.ИмяДляРазработчика ПОДОБНО &ИмяДляРазработчика СПЕЦСИМВОЛ ""~""
	|	И Таблица.Ссылка <> &СсылкаНаОбъект";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ПолноеИмяОбъекта);
	
	Реузльтат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Реузльтат.Вставить(ВРЕГ(Выборка.ИмяДляРазработчика), Истина);
	КонецЦикла;
	
	Возврат Реузльтат;
	
КонецФункции

Функция СпецСимволы()
	Диапазоны = Новый Массив;
	Диапазоны.Добавить(Новый Структура("Мин, Макс", 0, 32));
	Диапазоны.Добавить(Новый Структура("Мин, Макс", 127, 191));
	
	СпецСимволы = " .,+,-,/,*,?,=,<,>,(,)%!@#$%&*""№:;{}[]?()\|/`~'^_";
	Для Каждого Диапазон Из Диапазоны Цикл
		Для КодСимвола = Диапазон.Мин По Диапазон.Макс Цикл
			СпецСимволы = СпецСимволы + Символ(КодСимвола);
		КонецЦикла;
	КонецЦикла;
	Возврат СпецСимволы;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
